/*
Задача 2: Дана сторона квадрата a. Найти его площадь S=a^2

Категория: Ввод и вывод данных, оператор присваивания 

Все входные и выходные данные в заданиях этой группы являются вещественными числами

#category_begin
*/

let a = 3 // можно указать любое число, программа должна работать универсально
let S = a * a // в условии задачи указано найти площадь, а не вывести результат

// Возвести число в квадрат можно умножив его на себя или воспользовавшись функцией pow, которая возводит указанное число в любую степень
// let S = Math.pow(a, 2)

// Так же в некоторых язых программирования существует специальный оператор возведения числа в степень
// let S = a ** 2