/*
Задача 14: Дано целое число A. Проверить истинность высказывания: «Число A является нечетным»

Категория: Логические выражения

Во всех заданиях данной группы требуется вывести логическое значение True, если приведенное высказывание для предложенных исходных данных является истинным, и значение False в противном случае. Все числа, для которых указано количество цифр (двузначное число, трехзначное число и т. д.), считаются целыми положительными.

#category_boolean
*/

let A = 10

console.log(A % 2 == 0)